//Задача 10: Напишите программу, которая принимает 
//на вход трёхзначное число и на выходе показывает 
//вторую цифру этого числа. Обращаться к числу как 
//к строке нельзя.
//456 -> 5
//782 -> 8
//918 -> 1

// Console.WriteLine("Введите значение");
//  int N = Convert.ToInt32(Console.ReadLine());       
  
// for (int x= 1; x > 0; x--)

//   {
//     Console.WriteLine($"{N = N / 10}");
//     Console.WriteLine($"{N % 10}");
//   }
//   Console.WriteLine(); 
     

// Задача 13 Напишите программу, которая выводит третью цифру заданного числа или сообщает, 
// что третьей цифры нет. Обращаться к числу как к строке нельзя.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// Console.WriteLine("Введите значение");
// int a = Convert.ToInt32(Console.ReadLine());
// if (a > 99 && a < 1000)
//  {
//     Console.WriteLine($"{a = a / 10}");
//     Console.WriteLine($"{a = a % 10}");
//   }
// else
// Console.WriteLine("третьей цифры нет");
 
 
// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
// и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет 

//  Console.WriteLine("Введите значение"); 
//  int a = Convert.ToInt32(Console.ReadLine());          
//     if (a > 0 && a < 6)
//     Console.WriteLine("нет");
//     else
//     Console.WriteLine("да");
               
            
            
